# Binaries
brew "bat"
brew "btop"
brew "coreutils"
brew "docker-compose"
brew "ente-cli"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-flow"
brew "gnutls"
brew "gnupg"
brew "grep"
brew "hidapi"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "p7zip"
brew "pandoc"
brew "python@3.14"
brew "rclone"
brew "rmlint"
brew "rsync"
brew "stow"
brew "tailscale", link: false
brew "tmux"
brew "tree"
brew "virtualenvwrapper"
brew "zoxide"

# Casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "adobe-creative-cloud"
cask "alt-tab"
cask "appcleaner"
cask "bambu-studio"
cask "beeper"
cask "claude"
cask "devonthink"
cask "docker-desktop"
cask "dropbox"
cask "ente-auth"
cask "fantastical"
cask "flux-app"
cask "ghostty"
cask "hazel"
cask "iina"
cask "latest"
cask "logi-options+"
cask "mactex-no-gui"
cask "obsidian"
cask "rar"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "tailscale-app"
cask "todoist-app"
cask "visual-studio-code"
cask "zoom"
cask "zotero"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-junction"
cask "font-latin-modern"
cask "font-lato"
cask "font-open-sans"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "CardPointers", id: 1472875808
mas "DaisyDisk", id: 411643860
mas "Data Jar", id: 1453273600
mas "Flighty", id: 1358823008
mas "Foodnoms", id: 1479461686
mas "GoodLinks", id: 1474335294
mas "Hidden Bar", id: 1452453066
mas "Infuse", id: 1136220934
mas "Monarch Money Tweaks", id: 6753774259
mas "No Youtube Shorts", id: 6502996298
mas "Numbers", id: 361304891
mas "OverPicture", id: 1188020834
mas "Parcel", id: 375589283
mas "Play", id: 1596506190
mas "Raycast Companion", id: 6738274497
mas "Refined GitHub", id: 1519867270
mas "Shortery", id: 1594183810
mas "Sink It", id: 6449873635
mas "Sleeve", id: 1606145041
mas "SponsorBlock", id: 1573461917
mas "Timery", id: 1425368544
mas "Userscripts-Mac-App", id: 1463298887

# Visual Studio Code extensions
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "antyos.openscad"
vscode "blinkshellinc.blink-fs"
vscode "chouzz.vscode-better-align"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "streetsidesoftware.code-spell-checker"
vscode "supperchong.pretty-json"
vscode "teabyii.ayu"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
