# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "koekeishiya/formulae"
# Binaries
brew "jpeg-xl"
brew "aom"
brew "bash"
brew "bat"
brew "btop"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "chafa"
brew "coreutils"
brew "eza"
brew "unbound"
brew "gnutls"
brew "libarchive"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "ghostscript"
brew "git"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "grep"
brew "htop"
brew "httpie"
brew "mackup"
brew "mas"
brew "pinentry-mac"
brew "python@3.9"
brew "rclone"
brew "rmlint"
brew "stow"
brew "tmux"
brew "tree"
brew "virtualenvwrapper"
brew "zoxide"
brew "jakehilborn/jakehilborn/displayplacer"
# Casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "adobe-creative-cloud"
cask "aldente"
cask "alt-tab"
cask "amethyst"
cask "amie"
cask "appcleaner"
cask "arc"
cask "backblaze"
cask "betterdisplay"
cask "command-tab-plus"
cask "devonthink"
cask "discord"
cask "fantastical"
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-junction"
cask "font-latin-modern"
cask "font-lato"
cask "font-open-sans"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "hazel"
cask "iina"
cask "iterm2"
cask "latest"
cask "little-snitch"
cask "macmediakeyforwarder"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "nordvpn"
cask "notion-calendar"
cask "obsidian"
cask "rar"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle-pro"
cask "rocket"
cask "setapp"
cask "sigmaos"
cask "soundsource"
cask "tailscale"
cask "todoist"
cask "tower"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
# VSCode Plugins
vscode "chouzz.vscode-better-align"
vscode "esbenp.prettier-vscode"
vscode "huytd.nord-light"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "streetsidesoftware.code-spell-checker"
vscode "supperchong.pretty-json"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
# Mac App Store
mas '1Password for Safari', id: 1569813296
mas 'Crouton: Cooking Companion', id: 1461650987
mas 'Copilot: Track & Budget Money' id: 1447330651
mas 'DaisyDisk', id:411643860
mas 'Data Jar', id:1453273600
mas 'Eat the Shorts for Safari', id: 1668012393
mas 'GoodLinks', id: 1474335294
mas 'Logger for Shortcuts', id: 1611554653
mas 'NextDNS', id:1464122853
mas 'Parcel - Delivery Tracking', id: 639968404
mas 'Play: Save Videos Watch Later', id: 1596506190
mas 'Raivo Receiver', id:1498497896
mas 'Sleeve for Spotify, Music', id:1606145041
mas 'Shortery', id: 1594183810
mas 'Timery for Toggl', id: 1425368544
mas 'Things 3', id: 904280696
mas 'Vimari', id: 1480933944