# Binaries
brew "bat"
brew "btop"
brew "coreutils"
brew "exiftool"
brew "eza"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-flow"
brew "pinentry"
brew "gnupg"
brew "grep"
brew "hidapi"
brew "htop"
brew "imagemagick"
brew "jq"
brew "mas"
brew "pandoc"
brew "pinentry-mac"
brew "python"
brew "rclone"
brew "rmlint"
brew "rsync"
brew "stow"
brew "tmux"
brew "tree"
brew "virtualenvwrapper"
brew "zoxide"

# Casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "alt-tab"
cask "appcleaner"
cask "betterdisplay"
cask "chatgpt"
cask "devonthink"
cask "discord"
cask "dropbox"
cask "fantastical"
cask "freedom"
cask "ghostty"
cask "hazel"
cask "iina"
cask "latest"
cask "logi-options+"
cask "macmediakeyforwarder"
cask "miniconda"
cask "obsidian"
cask "rar"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "tailscale-app"
cask "todoist-app"
cask "visual-studio-code"
cask "zoom"
cask "zotero"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-junction"
cask "font-latin-modern"
cask "font-lato"
cask "font-open-sans"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "CardPointers", id: 1472875808
mas "Copilot", id: 1447330651
mas "DaisyDisk", id: 411643860
mas "Data Jar", id: 1453273600
mas "Flighty", id: 1358823008
mas "GoodLinks", id: 1474335294
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Logger", id: 1611554653
mas "MenuBox", id: 6463440793
mas "MusicBox", id: 1614730313
mas "Notability", id: 360593530
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "PiPifier", id: 1160374471
mas "Play", id: 1596506190
mas "Raivo OTP", id: 1498497896
mas "Raycast Companion", id: 6738274497
mas "Shortery", id: 1594183810
mas "Sink It", id: 6449873635
mas "Sleeve", id: 1606145041
mas "SponsorBlock", id: 1573461917
mas "Timery", id: 1425368544
mas "WaterMinder", id: 1415257369

# Visual Studio Code extensions
vscode "aaron-bond.better-comments"
vscode "chouzz.vscode-better-align"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "james-yu.latex-workshop"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "parallelsdesktop.parallels-desktop"
vscode "streetsidesoftware.code-spell-checker"
vscode "supperchong.pretty-json"
vscode "teabyii.ayu"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
